import { Box, Typography, Container, CssBaseline } from '@mui/material';
import React from 'react';

const UserTerms = () => {
  return (
    <React.Fragment>
      <CssBaseline />
      <Container maxWidth="lg">
        <Box py={6}>
          <Typography variant="h5" style={{ display: 'inline-block', verticalAlign: 'top' }}>
            Όροι Χρήσης
          </Typography>
          <Typography style={{ fontWeight: 600 }} gutterBottom>
            Όροι χρήσης
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            1. Tα πνευματικά δικαιώματα του Περιεχομένου (π.χ. προγράμματα, πληροφορίες, δεδομένα) και των Υπηρεσιών του
            διαδικτυακού τόπου (site) minasphone.gr που έχουν εισαχθεί στο Δίκτυο, προστατεύονται από τους ελληνικούς,
            κοινοτικούς και διεθνείς νόμους περί πνευματικής ιδιοκτησίας.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            2. Απαγορεύεται οποιαδήποτε αντιγραφή, διανομή, μεταφορά, μεταποίηση, μεταπώληση, δημιουργία παράγωγης
            εργασίας ή παραπλάνηση του κοινού σχετικά με τον πραγματικό παροχέα τους, του Περιεχομένου διαδικτυακού
            τόπου. Τυχόν αναπαραγωγή, επανέκδοση, φόρτωση, ανακοίνωση, διάδοση ή μετάδοση ή οποιαδήποτε άλλη χρήση του
            Περιεχομένου με οποιοδήποτε τρόπο ή μέσο για εμπορικούς ή άλλους σκοπούς επιτρέπεται μόνο κατόπιν
            προηγούμενης γραπτής άδειας του minasphone.gr ή οποιουδήποτε άλλου δικαιούχου των πνευματικών δικαιωμάτων.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            3. Το ηλεκτρονικό κατάστημα minasphone.gr παρέχει το Περιεχόμενο (π.χ. πληροφορίες, ονόματα, φωτογραφίες,
            απεικονίσεις), τα προϊόντα και τις υπηρεσίες που διατίθενται μέσω του διαδικτυακού τόπου “όπως ακριβώς
            έχουν”. Σε καμία περίπτωση το ηλεκτρονικό κατάστημα minasphone.gr δεν φέρει ευθύνη για τυχόν απαιτήσεις
            νομικής ή αστικής ή/και ποινικής φύσεως ούτε για τυχόν ζημία (θετική, ειδική ή αποθετική, η οποία ενδεικτικά
            και όχι περιοριστικά, διαζευκτικά ή και σωρευτικά συνίσταται σε απώλεια κερδών, δεδομένων, διαφυγόντα κέρδη,
            χρηματική ικανοποίηση κλπ.) από επισκέπτες του διαδικτυακού τόπου ή τρίτους από αιτία που έχει σχέση με τη
            λειτουργία ή μη ή και τη χρήση του διαδικτυακού τόπου ή και σε αδυναμία παροχής υπηρεσιών ή και πληροφοριών
            που διατίθενται από αυτόν ή και από τυχόν μη επιτρεπόμενες παρεμβάσεις τρίτων σε προϊόντα ή και υπηρεσίες ή
            και πληροφορίες που διατίθενται μέσω αυτού. Οι φωτογραφίες των προϊόντων είναι ενδεικτικές και δε φέρουμε
            καμία ευθύνη για τυχόν ορθογραφικά λάθη.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            4. Οι τιμές μπορούν να αλλάξουν χωρίς προειδοποίηση. Δέσμευση τιμών γίνεται μόνο μέσω ηλεκτρονικής
            παραγγελίας και επιβεβαίωσης της από το τμήμα παραγγελιών και όχι από το αυτοματοποιημένο μήνυμα καταχώρισης
            της παραγγελίας Το ηλεκτρονικό κατάστημα με το εμπορικό σήμα minasphone.gr ουδεμία εγγύηση μπορεί να
            παράσχει για τη διαθεσιμότητα των προϊόντων, αλλά αναλαμβάνει να ενημερώνει έγκαιρα τους πελάτες περί της μη
            διαθεσιμότητας. Ο πελάτης από τη στιγμή που θα επεξεργαστεί η παραγγελία από το τμήμα παραγγελιών και έχει
            επιβεβαιώσει την παραγγελία του, εξασφαλίζει πως θα παραλάβει το προϊόν με την τιμή την οποία “αποδέχτηκε”
            τη συναλλαγή έστω και αν η τιμή στην πορεία μεταβληθεί. Σε περίπτωση που τα προϊόντα ή οι υπηρεσίες
            αναφέρονται στον δικτυακό τόπο με λάθος τιμή λόγω τυπογραφικού σφάλματος τότε οι παραγγελίες ακυρώνονται
            αυτόματα. To minasphone.gr δεν ευθύνεται για τυχόν ζημιές που προκύψουν στον πελάτη/χρήστη του ηλεκτρονικού
            καταστήματος από την εκτέλεση ή μη των παραγγελιών ή από την καθυστέρηση εκτέλεσης για οποιονδήποτε λόγο.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            5. Η χρήση του διαδικτυακού τόπου πρέπει να γίνεται αποκλειστικά για νόμιμους σκοπούς και με τρόπο που να
            μην περιορίζει ή εμποδίζει τη χρήση του από τρίτους. Ο επισκέπτης υποχρεούται να χρησιμοποιεί το διαδικτυακό
            τόπο σύμφωνα με το νόμο, τα χρηστά ήθη και τους παρόντες όρους, και να μην προβαίνει σε πράξεις ή
            παραλείψεις που μπορούν να προκαλέσουν βλάβη ή δυσλειτουργία σε αυτόν, να επηρεάσουν ή να θέσουν σε κίνδυνο
            την παροχή των υπηρεσιών του minasphone.gr.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            6. Το ηλεκτρονικό κατάστημα minasphone.gr καταβάλλει κάθε δυνατή προσπάθεια για την καλή λειτουργία του
            διαδικτυακού του τόπου, δεν εγγυάται όμως ότι οι λειτουργίες του διαδικτυακού τόπου ή των servers θα είναι
            αδιάκοπες ή χωρίς κανενός είδους σφάλμα, απαλλαγμένες από ιούς ή άλλα παρόμοια στοιχεία.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            7. Το ηλεκτρονικό κατάστημα minasphone.gr διατηρεί το δικαίωμα να τροποποιεί, προσθέτει, μεταβάλλει το
            περιεχόμενο ή τις υπηρεσίες του διαδικτυακού τόπου, καθώς και τους όρους χρήσης, οποτεδήποτε το κρίνει
            αναγκαίο και χωρίς προηγούμενη προειδοποίηση, με μόνη την ανακοίνωσή τους μέσω του διαδικτυακού της τόπου.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            8. Τα ονόματα, εικόνες, λογότυπα και διακριτικά γνωρίσματα που αντιπροσωπεύουν το minasphone.gr ή τρίτα μέρη
            και τα προϊόντα ή τις υπηρεσίες τους, είναι αποκλειστικά σήματα του minasphone.gr ή τρίτων μερών
            προστατευμένα από τους σχετικούς νόμους περί εμπορικών σημάτων. Η εμφάνισή τους στον διαδικτυακό τόπο δεν θα
            πρέπει κατά κανένα τρόπο να εκληφθεί ως μεταβίβαση ή εκχώρηση άδειας ή δικαιώματος χρήσης τους.
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            9. Η επίσκεψη του διαδικτυακού τόπου προϋποθέτει την ανεπιφύλακτη αποδοχή των παραπάνω όρων και την χρήση
            των υπηρεσιών του minasphone.gr, όπως αυτοί εμφανίζονται στις αντίστοιχες υπηρεσίες.
          </Typography>
          <Typography style={{ fontWeight: 600 }} gutterBottom>
            Δήλωση απορρήτου
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            Απαραίτητη προϋπόθεση για την έναρξη της μεταξύ μας συνδιαλλαγής είναι η γνωστοποίηση από πλευράς σας
            κάποιων προσωπικών σας στοιχείων. Όταν κάνετε μια παραγγελία, θα σας ζητήσουμε το πλήρες ονοματεπώνυμό σας,
            τη διεύθυνση στην οποία θα αποσταλούν τα πωλούμενα προϊόντα, τον αριθμό του σταθερού σας τηλεφώνου και
            προαιρετικά όποιου άλλου τηλεφωνικού αριθμού για την καλύτερη εξυπηρέτηση σας και την μεταξύ μας επικοινωνία
            σε περίπτωση ανάγκης, την ηλεκτρονική σας διεύθυνση (e-mail) κ.λ.π. Επίσης λοιπά στοιχεία όπως επωνυμία,
            Α.Φ.Μ, αρμόδια Δ.Ο.Υ σε περίπτωση έκδοσης τιμολογίου. Η δραστηριότητα minasphone.gr, ακολουθώντας
            απαρέγκλιτα τις αρχές της προστασίας των προσωπικών δεδομένων που προβλέπονται από τους σχετικούς νόμους και
            διεθνείς συμβάσεις δεν πρόκειται να προβεί σε οποιαδήποτε αθέμιτη και χωρίς την προηγούμενη έγκρισή σας
            χρήση τους. Η παραπάνω αναφερόμενη, με κανέναν τρόπο δεν αποκαλύπτει, δημοσιοποιεί, πωλεί, ανταλλάσσει τα
            προσωπικά στοιχεία και τις πληροφορίες που μας εμπιστεύεστε. Εξαιρετικά μπορεί να δημοσιοποιηθούν προσωπικά
            σας στοιχεία από την εταιρεία, τηρουμένης πάντα της προβλεπόμενης από το νόμο διαδικασίας όταν τούτο
            επιβάλλεται από Δημόσια Αρχή, δικαστήριο κλπ.
          </Typography>
          <Typography style={{ fontWeight: 600 }} gutterBottom>
            Λογαριασμοί χρηστών
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            Οι λογαριασμοί χρηστών που διατηρούνται στο κατάστημά σας, θα πρέπει να έχουν όλα τα στοιχεία τους
            συμπληρωμένα. Λογαριασμοί με ελλιπή στοιχεία όπως Διεύθυνση και Τ.Κ θα διαγράφονται αυτόματα. Επίσης θα
            διαγράφονται λογαριασμοί με αδράνεια για μεγάλο χρονικό διάστημα. Όσων πελατών διαγραφεί ο λογαριασμός τους
            θα πρέπει να τον ξαναφτιάξουν με όλα τα στοιχεία τους συμπληρωμένα.
          </Typography>
          <Typography style={{ fontWeight: 600 }} gutterBottom>
            Πώληση αποκλειστικά και μόνο σε τελικούς χρήστες-καταναλωτές
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            Τα προϊόντα που διατίθενται από το ηλεκτρονικό κατάστημα προορίζονται και πωλούνται αποκλειστικά σε
            καταναλωτές ως τελικούς χρήστες και διατίθενται ανά καταναλωτή σε μέση ανά νοικοκυριό ποσότητα. Σε
            περιπτώσεις προωθητικών ενεργειών και προσφορών ή εκποίηση εμπορεύματος (Stock, refurbished,εκθεσιακά) η
            διάθεση περιορίζεται σε ένα (1) και μόνο τεμάχιο ανά τελικό καταναλωτή. Η περαιτέρω πώληση των προϊόντων για
            εμπορικούς σκοπούς, δεν επιτρέπεται καθώς δεν καθίσταται σαφές προς τον τελικό καταναλωτή ο νομικά
            οριζόμενος για την παροχή εγγύησης ή αντικατάστασης D.O.A . Tο ηλεκτρονικό κατάστημα minasphone.gr
            επιφυλάσσεται παντός δικαιώματός του, συμπεριλαμβανομένου ρητώς και της μη αποδοχής προτάσεων αγοράς που
            δημιουργούν την εντύπωση, ότι έγιναν με σκοπό την περαιτέρω εμπορική προώθηση των προϊόντων καθώς ως
            retailer εμπορική επιχείρηση δεν παρέχουμε χονδρική πώληση αγαθών. Οποιαδήποτε άλλη συναλλαγή και παραλαβή
            δεν γίνεται αποδεκτή. Εφόσον ακολουθηθούν τα παραπάνω θα προχωρήσουμε στην επεξεργασία, εκτέλεση και
            αποστολή της παραγγελίας σας.
          </Typography>
          <Typography style={{ fontWeight: 600 }} gutterBottom>
            Επιστροφές -RMA
          </Typography>
          <Typography variant="subtitle2" style={{ fontWeight: 400 }}>
            Μπορείτε να επιστρέψετε μέρος ή το σύνολο των αγαθών που παραγγείλατε μέσω του ηλεκτρονικού καταστήματός μας
            σε διάστημα δεκατεσσάρων (14) ημερολογιακών ημερών από την ημέρα παραλαβής τους και αφού έχει προηγηθεί
            πρώτα τηλεφωνική ή έγγραφη ενημέρωση. Το κόστος επιστροφής των προϊόντων επιβαρύνει τον αγοραστή. Σε
            περίπτωση κατά την οποία ευθύνεται η εταιρεία μας για την αλλαγή/επιστροφή του προϊόντος τότε επιβαρυνόμαστε
            εμείς το κόστος επιστροφής. Η προθεσμία αυτή ισχύει σε όλα τα κράτη μέλη της Ευρωπαϊκής Ένωσης ενώ σε
            περίπτωση που δεν έχει ενημερωθεί προηγουμένως για το δικαίωμά του αυτό, τότε η προθεσμία αυτή επεκτείνεται
            στους 12 μήνες.
          </Typography>
        </Box>
        <div></div>
      </Container>
    </React.Fragment>
  );
};

export default UserTerms;
